src/cf/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеРасходы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Выручка</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ВаловаяПрибыль</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ПлановыеПоказатели/ПлановыеПоказатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеПоказатели</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>План</name>
    <type>
      <types>Characteristic.ПоказателиРасчётаПремий</types>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Факт</name>
    <type>
      <types>Characteristic.ПоказателиРасчётаПремий</types>
    </type>
  </resources>
  <resources>
    <name>ID</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПоказателиРасчётаПремий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDРодитель</name>
    <comment>Для связи в виде &quot;Дерево&quot;</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/Убытки/Убытки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Убытки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ДополнительныеРасходы/ДополнительныеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДополнительныеРасходы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикат</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ПоказателиПродаж/ПоказателиПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоказателиПродаж</name>
  <enumValues>
    <name>Выручка</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтОплат</name>
  </enumValues>
  <enumValues>
    <name>Оплаты</name>
  </enumValues>
  <enumValues>
    <name>Прибыль</name>
  </enumValues>
  <enumValues>
    <name>Количество</name>
  </enumValues>
  <enumValues>
    <name>Рентабельность</name>
  </enumValues>
  <enumValues>
    <name>ЧистаяПрибыль</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/ВидыЦен/ВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЦен</name>
  <predefined>
    <items>
      <name>Закупочная</name>
      <description>Prix d'achat</description>
    </items>
    <items>
      <name>Розничная</name>
      <description>Prix de vente</description>
    </items>
    <items>
      <name>МинимальнаяЦенаПродажи</name>
      <description>Prix minimal</description>
    </items>
  </predefined>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДинамическийРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсноваРасчёта</name>
    <type>
      <types>EnumRef.ОсновыРасчётаНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНаценки</name>
    <type>
      <types>EnumRef.ВидыНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Точность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Уникальный идентификатор пользователя информационной базы</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходВПрограммуРазрешен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Роли</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтображатьОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/AccumulationRegisters/Продажи/ManagerModule.bsl
#Область Формирование_движений

Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Движения = ДокОбъект.Движения;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Ответственный = ДокОбъект.Ответственный;
		ТЗДанные = СформироватьДанные(ДокОбъект, ДокОбъект.ТЧТовары.Выгрузить(), ДокОбъект.Менеджер, ДокОбъект.Контрагент, ДокОбъект.Ссылка, ДокОбъект.ХозяйственнаяОперация, Ответственный, ДокОбъект.МестоХранения);
		Движения.Продажи.Загрузить(ТЗДанные);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратОтПокупателя") И ЗначениеЗаполнено(ДокОбъект.Основание) Тогда	
		ТЗПартии = Движения.ТоварыВНаличии.Выгрузить();
		ТЗПартии.Свернуть("Номенклатура, Характеристика, Партия", "Количество");
		УменьшитьПрибыльПоВозврату(ДокОбъект, ТЗПартии);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.КорректировкаДолга") Тогда 
		Если Не ОбщегоНазначенияВызовСервераПовтИсп.ЭтоРасчётыСПокупателями(ДокОбъект.ХозяйственнаяОперация) Тогда Возврат КонецЕсли;
		Мас = ДокОбъект.ДополнительныеСвойства.ТЗКредиторскаяЗадолженность.НайтиСтроки(Новый Структура("СПокупателем", Истина));
		Для Каждого Стр Из Мас Цикл
			ОбъектРасчётов = Стр.ОбъектРасчётов;
			Если Не ТипЗнч(Стр.ОбъектРасчётов) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда Продолжить; КонецЕсли;
			УменьшитьПрибыльПоКорректировке(ДокОбъект, ОбъектРасчётов, Стр.Сумма); 
		КонецЦикла;
		Мас = ДокОбъект.ДополнительныеСвойства.ТЗДебиторскаяЗадолженность.НайтиСтроки(Новый Структура("СПокупателем", Истина));
		Для Каждого Стр Из Мас Цикл
			ОбъектРасчётов = Стр.ОбъектРасчётов;
			Если Не ТипЗнч(Стр.ОбъектРасчётов) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда Продолжить; КонецЕсли;
			УменьшитьПрибыльПоКорректировке(ДокОбъект, ОбъектРасчётов, Стр.Сумма); 
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

Процедура УменьшитьПрибыльПоВозврату(ДокОбъект, ТЗВозврат)
	Движения = ДокОбъект.Движения;
	НЗ = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(ДокОбъект.Основание);
	НЗ.Прочитать();
	ТЗПрибыль = НЗ.Выгрузить();
	Для Каждого Стр Из ТЗВозврат Цикл
		Мас = ТЗПрибыль.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Партия", Стр.Номенклатура, Стр.Характеристика, Стр.Партия));
		Для Каждого МасСтр Из Мас Цикл
			НС = Движения.Продажи.Добавить();
			ЗаполнитьЗначенияСвойств(НС, МасСтр);
			НС.Период = ДокОбъект.Дата;
			НС.ХозяйственнаяОперация = ДокОбъект.ХозяйственнаяОперация;
			НС.Количество = -Стр.Количество;
			НС.Себестоимость = -?(Стр.Количество = МасСтр.Количество, МасСтр.Себестоимость, МасСтр.Себестоимость / МасСтр.Количество * Стр.Количество);
			НС.ДополнительныеРасходы = -?(Стр.Количество = МасСтр.Количество, МасСтр.ДополнительныеРасходы, МасСтр.ДополнительныеРасходы / МасСтр.Количество * Стр.Количество);
			НС.Выручка = -?(Стр.Количество = МасСтр.Количество, МасСтр.Выручка, МасСтр.Выручка / МасСтр.Количество * Стр.Количество);
			НС.НДС = -?(Стр.Количество = МасСтр.Количество, МасСтр.НДС, МасСтр.НДС / МасСтр.Количество * Стр.Количество);
			НС.ВаловаяПрибыль = -?(Стр.Количество = МасСтр.Количество, МасСтр.ВаловаяПрибыль, МасСтр.ВаловаяПрибыль / МасСтр.Количество * Стр.Количество);
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры

Процедура УменьшитьПрибыльПоКорректировке(ДокОбъект, ОбъектРасчётов, Сумма)
	Движения = ДокОбъект.Движения;
	НЗ = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(ОбъектРасчётов);
	НЗ.Прочитать();
	ТЗПрибыль = НЗ.Выгрузить();
	ВыручкаИтого = ТЗПрибыль.Итог("Выручка");
	СуммаОстаток = Сумма;
	КоличествоСтрок = ТЗПрибыль.Количество();
	НомерСтроки = 0;
	Для Каждого Стр Из ТЗПрибыль Цикл
		НомерСтроки = НомерСтроки + 1;
		НС = Движения.Продажи.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Стр,,"Количество,Себестоимость,ДополнительныеРасходы");
		НС.Период = ДокОбъект.Дата;
		НС.ХозяйственнаяОперация = ДокОбъект.ХозяйственнаяОперация;
		НС.Выручка = -?(НомерСтроки = КоличествоСтрок, СуммаОстаток, Стр.Выручка / ВыручкаИтого * Сумма);
		НС.НДС = - Стр.НДС / ВыручкаИтого * Сумма;
		НС.ВаловаяПрибыль = Стр.ВаловаяПрибыль / ВыручкаИтого * Сумма;
		СуммаОстаток = СуммаОстаток + НС.Выручка;
	КонецЦикла;	
КонецПроцедуры

Функция СформироватьДанные(ДокОбъект, ТЗТовары, Сотрудник, Контрагент, ДокументПродажи, ХозяйственнаяОперация, Ответственный = Неопределено, МестоХранения)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(ТЗТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗТовары.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	                      |	ВЫРАЗИТЬ(ТЗТовары.Количество КАК ЧИСЛО) КАК Количество,
	                      |	ВЫРАЗИТЬ(ТЗТовары.СуммаСНДС КАК ЧИСЛО) КАК Выручка,
	                      |	ВЫРАЗИТЬ(ТЗТовары.СуммаНДС КАК ЧИСЛО) КАК НДС
	                      |ПОМЕСТИТЬ ВТТовары
	                      |ИЗ
	                      |	&ТЗТовары КАК ТЗТовары
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЗПартии.ВидДвижения КАК ВидДвижения,
	                      |	ВЫРАЗИТЬ(ТЗПартии.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗПартии.Комплект КАК Справочник.Номенклатура) КАК Комплект,
	                      |	ВЫРАЗИТЬ(ТЗПартии.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	                      |	ТЗПартии.Партия КАК Партия,
	                      |	ВЫРАЗИТЬ(ТЗПартии.Сумма КАК ЧИСЛО) КАК Себестоимость,
	                      |	ВЫРАЗИТЬ(ТЗПартии.Количество КАК ЧИСЛО) КАК Количество
	                      |ПОМЕСТИТЬ ВТПартии
	                      |ИЗ
	                      |	&ТЗПартии КАК ТЗПартии
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЗДополнительныеРасходы.ВидДвижения КАК ВидДвижения,
	                      |	ВЫРАЗИТЬ(ТЗДополнительныеРасходы.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗДополнительныеРасходы.Комплект КАК Справочник.Номенклатура) КАК Комплект,
	                      |	ВЫРАЗИТЬ(ТЗДополнительныеРасходы.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	                      |	ТЗДополнительныеРасходы.Партия КАК Партия,
	                      |	ВЫРАЗИТЬ(ТЗДополнительныеРасходы.Сумма КАК ЧИСЛО) КАК Сумма
	                      |ПОМЕСТИТЬ ВЗДополнительныеРасходы
	                      |ИЗ
	                      |	&ТЗДополнительныеРасходы КАК ТЗДополнительныеРасходы
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЫБОР
	                      |		КОГДА ВЗ.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |			ТОГДА ВЗ.Номенклатура
	                      |		ИНАЧЕ ВЗ.Комплект
	                      |	КОНЕЦ КАК Номенклатура,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВЗ.Партия КАК Партия,
	                      |	СУММА(ВЗ.Количество) КАК Количество,
	                      |	СУММА(ВЗ.Себестоимость) КАК Себестоимость,
	                      |	СУММА(ВЗ.ДополнительныеРасходы) КАК ДополнительныеРасходы
	                      |ПОМЕСТИТЬ ВТПартииРасходы
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВТПартии.Номенклатура КАК Номенклатура,
	                      |		ВТПартии.Комплект КАК Комплект,
	                      |		ВТПартии.Характеристика КАК Характеристика,
	                      |		ВТПартии.Партия КАК Партия,
	                      |		ВТПартии.Количество КАК Количество,
	                      |		ВТПартии.Себестоимость КАК Себестоимость,
	                      |		0 КАК ДополнительныеРасходы
	                      |	ИЗ
	                      |		ВТПартии КАК ВТПартии
	                      |	ГДЕ
	                      |		ВТПартии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		ВЗДополнительныеРасходы.Номенклатура,
	                      |		ВЗДополнительныеРасходы.Комплект,
	                      |		ВЗДополнительныеРасходы.Характеристика,
	                      |		ВЗДополнительныеРасходы.Партия,
	                      |		0,
	                      |		0,
	                      |		ВЗДополнительныеРасходы.Сумма
	                      |	ИЗ
	                      |		ВЗДополнительныеРасходы КАК ВЗДополнительныеРасходы
	                      |	ГДЕ
	                      |		ВЗДополнительныеРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)) КАК ВЗ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВЫБОР
	                      |		КОГДА ВЗ.Комплект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |			ТОГДА ВЗ.Номенклатура
	                      |		ИНАЧЕ ВЗ.Комплект
	                      |	КОНЕЦ,
	                      |	ВЗ.Характеристика,
	                      |	ВЗ.Партия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	&Период КАК Период,
	                      |	&Организация КАК Организация,
	                      |	&Сотрудник КАК Сотрудник,
	                      |	&Контрагент КАК Контрагент,
	                      |	&ДокументПродажи КАК ДокументПродажи,
	                      |	&Ответственный КАК Ответственный,
	                      |	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	                      |	&МестоХранения КАК МестоХранения,
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВЗ.Партия КАК Партия,
	                      |	ВЗ.Количество КАК Количество,
	                      |	ВЗ.Себестоимость КАК Себестоимость,
	                      |	ВЗ.ДополнительныеРасходы КАК ДополнительныеРасходы,
	                      |	ВЗ.Выручка КАК Выручка,
	                      |	ВЗ.НДС КАК НДС,
	                      |	ВЗ.Выручка - ВЗ.Себестоимость - ВЗ.ДополнительныеРасходы КАК ВаловаяПрибыль
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВЗ.Номенклатура КАК Номенклатура,
	                      |		ВЗ.Характеристика КАК Характеристика,
	                      |		ЕСТЬNULL(ВТПартииРасходы.Партия, НЕОПРЕДЕЛЕНО) КАК Партия,
	                      |		ЕСТЬNULL(ВТПартииРасходы.Количество, ВЗ.Количество) КАК Количество,
	                      |		ВЗ.Выручка / ВЗ.Количество * ЕСТЬNULL(ВТПартииРасходы.Количество, ВЗ.Количество) КАК Выручка,
	                      |		ВЗ.НДС / ВЗ.Количество * ЕСТЬNULL(ВТПартииРасходы.Количество, ВЗ.Количество) КАК НДС,
	                      |		ВЫБОР
	                      |			КОГДА ВЗ.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	                      |				ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
	                      |			ИНАЧЕ ЕСТЬNULL(ВТПартииРасходы.Себестоимость, 0)
	                      |		КОНЕЦ КАК Себестоимость,
	                      |		ЕСТЬNULL(ВТПартииРасходы.ДополнительныеРасходы, 0) КАК ДополнительныеРасходы
	                      |	ИЗ
	                      |		(ВЫБРАТЬ
	                      |			ВТТовары.Номенклатура КАК Номенклатура,
	                      |			ВТТовары.Характеристика КАК Характеристика,
	                      |			СУММА(ВТТовары.Количество) КАК Количество,
	                      |			СУММА(ВТТовары.Выручка) КАК Выручка,
	                      |			СУММА(ВТТовары.НДС) КАК НДС
	                      |		ИЗ
	                      |			ВТТовары КАК ВТТовары
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ВТТовары.Номенклатура,
	                      |			ВТТовары.Характеристика) КАК ВЗ
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ ВТПартииРасходы КАК ВТПартииРасходы
	                      |			ПО ВЗ.Номенклатура = ВТПартииРасходы.Номенклатура
	                      |				И ВЗ.Характеристика = ВТПартииРасходы.Характеристика
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, ) КАК ЦеныНоменклатуры
	                      |			ПО ВЗ.Номенклатура = ЦеныНоменклатуры.Номенклатура
	                      |				И ВЗ.Характеристика = ЦеныНоменклатуры.Характеристика
	                      |				И (ЦеныНоменклатуры.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.Закупочная))) КАК ВЗ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТПартии.Номенклатура КАК Номенклатура,
	                      |	ВТПартии.Характеристика КАК Характеристика,
	                      |	ВТПартии.Партия КАК Партия,
	                      |	ВТПартии.Количество КАК Количество
	                      |ИЗ
	                      |	ВТПартии КАК ВТПартии
	                      |ГДЕ
	                      |	ВТПартии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	Запрос.УстановитьПараметр("ТЗТовары", ТЗТовары);
	Запрос.УстановитьПараметр("ТЗПартии", ПолучитьТЗПартииПоРеализации(ДокОбъект));
	Запрос.УстановитьПараметр("ТЗДополнительныеРасходы", ПолучитьДополнительныеРасходыПоРеализации(ДокОбъект));
	Запрос.УстановитьПараметр("Период", ДокОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", ДокОбъект.Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДокументПродажи", ДокументПродажи);
	Запрос.УстановитьПараметр("МестоХранения", ДокументПродажи.МестоХранения);
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	ТЗДанные = Запрос.ВыполнитьПакет()[4].Выгрузить();
	РаспределитьВыручкуПоСебестоимости(ТЗДанные, ТЗТовары);
	Возврат ТЗДанные;
КонецФункции

Процедура РаспределитьВыручкуПоСебестоимости(ТЗДанные, ТЗТовары)
	// Выручка и НДС строки документа распределяются по партиям пропорционально себестоимости
	// (при нулевой себестоимости - поровну по количеству), остаток от округления - на последнюю
	// строку. Для комплектов партии составляющих уже свёрнуты в комплект.
	ТЗТоварыСводный = ТЗТовары.Скопировать(, "Номенклатура, Характеристика, Количество, СуммаСНДС, СуммаНДС");
	ТЗТоварыСводный.Свернуть("Номенклатура, Характеристика", "Количество, СуммаСНДС, СуммаНДС");
	Для Каждого Стр Из ТЗТоварыСводный Цикл
		Мас = ТЗДанные.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Стр.Номенклатура, Стр.Характеристика));
		Если Мас.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СебестоимостьИтог = 0;
		КоличествоИтог = 0;
		Для Каждого Эл Из Мас Цикл
			СебестоимостьИтог = СебестоимостьИтог + Эл.Себестоимость;
			КоличествоИтог = КоличествоИтог + Эл.Количество;
		КонецЦикла;
		ОстатокВыручка = Стр.СуммаСНДС;
		ОстатокНДС = Стр.СуммаНДС;
		НомерСтроки = 0;
		Для Каждого Эл Из Мас Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки = Мас.Количество() Тогда
				Эл.Выручка = ОстатокВыручка;
				Эл.НДС = ОстатокНДС;
			Иначе
				Доля = ДоляСтрокиРаспределения(Эл, СебестоимостьИтог, КоличествоИтог);
				Эл.Выручка = Окр(Стр.СуммаСНДС * Доля, РазрядностьСуммы());
				Эл.НДС = Окр(Стр.СуммаНДС * Доля, РазрядностьСуммы());
				ОстатокВыручка = ОстатокВыручка - Эл.Выручка;
				ОстатокНДС = ОстатокНДС - Эл.НДС;
			КонецЕсли;
			Эл.ВаловаяПрибыль = Эл.Выручка - Эл.Себестоимость - Эл.ДополнительныеРасходы;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция ДоляСтрокиРаспределения(Эл, СебестоимостьИтог, КоличествоИтог)
	// Доля строки в распределении: по себестоимости, при нулевой - поровну по количеству.
	Если СебестоимостьИтог <> 0 Тогда
		Возврат Эл.Себестоимость / СебестоимостьИтог;
	ИначеЕсли КоличествоИтог <> 0 Тогда
		Возврат Эл.Количество / КоличествоИтог;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция РазрядностьСуммы()
	Возврат 2;
КонецФункции	

#КонецОбласти

#Область Остатки

Функция ПолучитьВыручкуПоТоварнойГруппе(НачалоПериода, КонецПериода, МасСотрудники, ТоварнаяГруппа) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СУММА(ПродажиОбороты.ВыручкаОборот) КАК Сумма
	                      |ИЗ
	                      |	РегистрНакопления.Продажи.Обороты(
	                      |			&НачалоПериода,
	                      |			&КонецПериода,
	                      |			,
	                      |			ВЫБОР
	                      |					КОГДА &СотрудникиУказаны
	                      |						ТОГДА Сотрудник В (&Сотрудники)
	                      |					ИНАЧЕ ИСТИНА
	                      |				КОНЕЦ
	                      |				И Номенклатура.ТоварнаяГруппа = &ТоварнаяГруппа) КАК ПродажиОбороты");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Сотрудники", МасСотрудники);
	Запрос.УстановитьПараметр("СотрудникиУказаны", МасСотрудники.Количество() > 0);
	Запрос.УстановитьПараметр("ТоварнаяГруппа", ТоварнаяГруппа);
	Возврат Запрос.Выполнить().Выгрузить().Итог("Сумма");
КонецФункции

#КонецОбласти

#Область Остатки_и_аналитика

Функция ПолучитьПроцентПланаПродажПоМенеджеру(Период, Менеджер, Показатель) Экспорт
	Структура = Новый Структура("План, Факт, Процент", 0, 0, 0);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПродажиОбороты.Сотрудник как Менеджер,
	                      |	СУММА(ПродажиОбороты.ВыручкаОборот) КАК Факт,
	                      |	СУММА(0) КАК План
	                      |ИЗ
	                      |	РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Месяц, Сотрудник = &Менеджер) КАК ПродажиОбороты
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ПродажиОбороты.Сотрудник
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ПлановыеПоказателиСрезПоследних.Сотрудник,
	                      |	0,
	                      |	ПлановыеПоказателиСрезПоследних.План
	                      |ИЗ
	                      |	РегистрСведений.ПлановыеПоказатели.СрезПоследних(
	                      |			&ДатаНач,
	                      |			Сотрудник = &Менеджер
	                      |				И Показатель = &Показатель) КАК ПлановыеПоказателиСрезПоследних");
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(КонецМесяца(Период)));
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	Запрос.УстановитьПараметр("Показатель", Показатель);
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Свернуть("Менеджер", "Факт, План");
	Если ТЗ.Количество() > 0 Тогда
		Стр = ТЗ[0];
		Структура.План = Стр.План;
		Структура.Факт = Стр.Факт;
		Структура.Процент = ?(Стр.План = 0, 100, Окр(Стр.Факт / (Стр.План / 100)));
	КонецЕсли;	
	Возврат Структура;	
КонецФункции

// Возвращает сумму показателя продаж за период по отбору.
//
// Параметры:
//  НачалоПериода - Дата - начало периода (включительно).
//  КонецПериода - Дата - конец периода (включительно).
//  Отбор - Структура - описание отбора:
//   * Показатель - ПеречислениеСсылка.ПоказателиПродаж - Выручка, Прибыль, Количество или ЧистаяПрибыль;
//   * Параметры - Массив - значения отбора, разрез определяется типом значения:
//     СправочникСсылка.Контрагенты, СправочникСсылка.Номенклатура (элемент или группа, отбор в иерархии),
//     СправочникСсылка.МестаХранения (отбор в иерархии), СправочникСсылка.ФизическиеЛица (продавец),
//     ПеречислениеСсылка.ТипыНоменклатуры;
//   * Сотрудник - Массив - (необязательно) продавцы; то же, что ФизическиеЛица в Параметры.
//  Продавец - сотрудник (менеджер) документа продажи, а если он не заполнен - физическое лицо ответственного.
//
// Возвращаемое значение:
//  Число - сумма показателя. Для ЧистаяПрибыль - валовая прибыль за вычетом затрат регистра Убытки
//  по тем же местам хранения, что и в отборе.
//
Функция ПолучитьСуммуПоказателяПродажПоПараметру(НачалоПериода, КонецПериода, Отбор) Экспорт
	Если Не ЗначениеЗаполнено(Отбор.Показатель) Тогда
		Возврат 0;
	КонецЕсли;
	Параметры = ПараметрыОтбораПродаж(Отбор);
	ТЗ = ТаблицаПоказателейПродаж(НачалоПериода, КонецПериода, Параметры);
	Сумма = ТЗ.Итог(ИмяКолонкиПоказателя(Отбор.Показатель));
	Если Отбор.Показатель = Перечисления.ПоказателиПродаж.ЧистаяПрибыль Тогда
		Сумма = Сумма - РегистрыНакопления.Убытки.ПолучитьЗатраты(НачалоПериода, КонецПериода, Параметры.Магазины);
	КонецЕсли;
	Возврат Сумма;
КонецФункции

// Возвращает суммы показателя продаж за период в разрезе продавцов.
// Затраты регистра Убытки по продавцам не распределяются: для ЧистаяПрибыль возвращается валовая прибыль продавца.
//
// Параметры:
//  НачалоПериода - Дата - начало периода (включительно).
//  КонецПериода - Дата - конец периода (включительно).
//  Отбор - Структура - см. ПолучитьСуммуПоказателяПродажПоПараметру.
//
// Возвращаемое значение:
//  Соответствие - ключ: СправочникСсылка.ФизическиеЛица (продавец), значение: Число - сумма показателя.
//
Функция ПолучитьСуммыПоказателяПродажПоПродавцам(НачалоПериода, КонецПериода, Отбор) Экспорт
	Результат = Новый Соответствие;
	Если Не ЗначениеЗаполнено(Отбор.Показатель) Тогда
		Возврат Результат;
	КонецЕсли;
	ТЗ = ТаблицаПоказателейПродаж(НачалоПериода, КонецПериода, ПараметрыОтбораПродаж(Отбор));
	ИмяКолонки = ИмяКолонкиПоказателя(Отбор.Показатель);
	Для Каждого Стр Из ТЗ Цикл
		Результат.Вставить(Стр.Продавец, Стр[ИмяКолонки]);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ПараметрыОтбораПродаж(Отбор)
	Результат = Новый Структура;
	Результат.Вставить("Контрагенты", Новый Массив);
	Результат.Вставить("ТоварныеГруппы", Новый Массив);
	Результат.Вставить("Магазины", Новый Массив);
	Результат.Вставить("Сотрудники", Новый Массив);
	Результат.Вставить("ТипыНоменклатуры", Новый Массив);
	МасСотрудники = Неопределено;
	Если Отбор.Свойство("Сотрудник", МасСотрудники) И ТипЗнч(МасСотрудники) = Тип("Массив") Тогда
		Для Каждого Сотрудник Из МасСотрудники Цикл
			Результат.Сотрудники.Добавить(Сотрудник);
		КонецЦикла;
	КонецЕсли;
	МасПараметры = Неопределено;
	Если Не Отбор.Свойство("Параметры", МасПараметры) Или МасПараметры = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	Для Каждого Параметр Из МасПараметры Цикл
		ТипПараметра = ТипЗнч(Параметр);
		Если ТипПараметра = Тип("СправочникСсылка.Контрагенты") Тогда
			Результат.Контрагенты.Добавить(Параметр);
		ИначеЕсли ТипПараметра = Тип("СправочникСсылка.Номенклатура") Тогда
			Результат.ТоварныеГруппы.Добавить(Параметр);
		ИначеЕсли ТипПараметра = Тип("СправочникСсылка.МестаХранения") Тогда
			Результат.Магазины.Добавить(Параметр);
		ИначеЕсли ТипПараметра = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Результат.Сотрудники.Добавить(Параметр);
		ИначеЕсли ТипПараметра = Тип("ПеречислениеСсылка.ТипыНоменклатуры") Тогда
			Результат.ТипыНоменклатуры.Добавить(Параметр);
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ИмяКолонкиПоказателя(Показатель)
	Если Показатель = Перечисления.ПоказателиПродаж.Выручка Тогда
		Возврат "Выручка";
	ИначеЕсли Показатель = Перечисления.ПоказателиПродаж.Количество Тогда
		Возврат "Количество";
	Иначе // Прибыль, ЧистаяПрибыль
		Возврат "Прибыль";
	КонецЕсли;
КонецФункции

Функция ТаблицаПоказателейПродаж(НачалоПериода, КонецПериода, Параметры)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПродажиОбороты.Сотрудник КАК Сотрудник,
	                      |	ПродажиОбороты.Ответственный КАК Ответственный,
	                      |	ПродажиОбороты.Номенклатура КАК Номенклатура,
	                      |	ПродажиОбороты.КоличествоОборот КАК Количество,
	                      |	ПродажиОбороты.ВыручкаОборот КАК Выручка,
	                      |	ПродажиОбороты.ВаловаяПрибыльОборот КАК Прибыль
	                      |ПОМЕСТИТЬ ВТОбороты
	                      |ИЗ
	                      |	РегистрНакопления.Продажи.Обороты(
	                      |			&НачалоПериода,
	                      |			&КонецПериода,
	                      |			,
	                      |			ВЫБОР
	                      |					КОГДА &КонтрагентыУказаны
	                      |						ТОГДА Контрагент В (&Контрагенты)
	                      |					ИНАЧЕ ИСТИНА
	                      |				КОНЕЦ
	                      |				И ВЫБОР
	                      |					КОГДА &ТоварныеГруппыУказаны
	                      |						ТОГДА Номенклатура В ИЕРАРХИИ (&ТоварныеГруппы)
	                      |					ИНАЧЕ ИСТИНА
	                      |				КОНЕЦ
	                      |				И ВЫБОР
	                      |					КОГДА &МагазиныУказаны
	                      |						ТОГДА МестоХранения В ИЕРАРХИИ (&Магазины)
	                      |					ИНАЧЕ ИСТИНА
	                      |				КОНЕЦ) КАК ПродажиОбороты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЫБОР
	                      |		КОГДА ВТОбороты.Сотрудник = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	                      |			ТОГДА ЕСТЬNULL(Пользователи.ФизическоеЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	                      |		ИНАЧЕ ВТОбороты.Сотрудник
	                      |	КОНЕЦ КАК Продавец,
	                      |	ВТОбороты.Количество КАК Количество,
	                      |	ВТОбороты.Выручка КАК Выручка,
	                      |	ВТОбороты.Прибыль КАК Прибыль
	                      |ПОМЕСТИТЬ ВТПродажи
	                      |ИЗ
	                      |	ВТОбороты КАК ВТОбороты
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	                      |		ПО ВТОбороты.Ответственный = Пользователи.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	                      |		ПО ВТОбороты.Номенклатура = Номенклатура.Ссылка
	                      |ГДЕ
	                      |	ВЫБОР
	                      |		КОГДА &ТипыНоменклатурыУказаны
	                      |			ТОГДА Номенклатура.ТипНоменклатуры В (&ТипыНоменклатуры)
	                      |		ИНАЧЕ ИСТИНА
	                      |	КОНЕЦ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТПродажи.Продавец КАК Продавец,
	                      |	СУММА(ВТПродажи.Количество) КАК Количество,
	                      |	СУММА(ВТПродажи.Выручка) КАК Выручка,
	                      |	СУММА(ВТПродажи.Прибыль) КАК Прибыль
	                      |ИЗ
	                      |	ВТПродажи КАК ВТПродажи
	                      |ГДЕ
	                      |	ВЫБОР
	                      |		КОГДА &СотрудникиУказаны
	                      |			ТОГДА ВТПродажи.Продавец В (&Сотрудники)
	                      |		ИНАЧЕ ИСТИНА
	                      |	КОНЕЦ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТПродажи.Продавец");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Сотрудники", Параметры.Сотрудники);
	Запрос.УстановитьПараметр("СотрудникиУказаны", Параметры.Сотрудники.Количество() > 0);
	Запрос.УстановитьПараметр("Контрагенты", Параметры.Контрагенты);
	Запрос.УстановитьПараметр("КонтрагентыУказаны", Параметры.Контрагенты.Количество() > 0);
	Запрос.УстановитьПараметр("ТоварныеГруппы", Параметры.ТоварныеГруппы);
	Запрос.УстановитьПараметр("ТоварныеГруппыУказаны", Параметры.ТоварныеГруппы.Количество() > 0);
	Запрос.УстановитьПараметр("Магазины", Параметры.Магазины);
	Запрос.УстановитьПараметр("МагазиныУказаны", Параметры.Магазины.Количество() > 0);
	Запрос.УстановитьПараметр("ТипыНоменклатуры", Параметры.ТипыНоменклатуры);
	Запрос.УстановитьПараметр("ТипыНоменклатурыУказаны", Параметры.ТипыНоменклатуры.Количество() > 0);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьТаблицуПроцентыПланаРентабельностиПоМенеджеру(Период, Менеджер, Показатель) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПродажиОбороты.Сотрудник КАК Сотрудник,
	                      |	ПродажиОбороты.ДокументПродажи КАК ДокументПродажи,
	                      |	СУММА(ПродажиОбороты.ВаловаяПрибыльОборот) КАК Прибыль,
	                      |	СУММА(ПродажиОбороты.ВыручкаОборот) КАК Выручка,
	                      |	ВЫРАЗИТЬ(ЕСТЬNULL(ПлановыеПоказателиСрезПоследних.План, 0) КАК ЧИСЛО) КАК План
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Месяц, Сотрудник = &Менеджер) КАК ПродажиОбороты
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеПоказатели.СрезПоследних(
	                      |				&ДатаНач,
	                      |				Сотрудник = &Менеджер
	                      |					И Показатель = &Показатель) КАК ПлановыеПоказателиСрезПоследних
	                      |		ПО ПродажиОбороты.Сотрудник = ПлановыеПоказателиСрезПоследних.Сотрудник
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ПродажиОбороты.Сотрудник,
	                      |	ПродажиОбороты.ДокументПродажи,
	                      |	ВЫРАЗИТЬ(ЕСТЬNULL(ПлановыеПоказателиСрезПоследних.План, 0) КАК ЧИСЛО)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.Сотрудник КАК Сотрудник,
	                      |	ВТ.ДокументПродажи КАК ДокументПродажи,
	                      |	ВТ.Прибыль КАК Прибыль,
	                      |	ВТ.План КАК План,
	                      |	ВЫРАЗИТЬ(ВЫБОР
	                      |			КОГДА ВТ.План = 0 или ВТ.Выручка = 0
	                      |				ТОГДА 100
	                      |			ИНАЧЕ ВТ.Прибыль / ВТ.Выручка * 100 / ВТ.План * 100
	                      |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Процент
	                      |ИЗ
	                      |	ВТ КАК ВТ");
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(КонецМесяца(Период)));
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	Запрос.УстановитьПараметр("Показатель", Показатель);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;	
КонецФункции

Функция ПолучитьТЗПартииПоРеализации(ДокОбъект)
	Если ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.НакладнаяПоОтгрузкамТовара Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВНаличии.Период КАК Период,
		|	ТоварыВНаличии.Регистратор КАК Регистратор,
		|	ТоварыВНаличии.НомерСтроки КАК НомерСтроки,
		|	ТоварыВНаличии.Активность КАК Активность,
		|	ТоварыВНаличии.ВидДвижения КАК ВидДвижения,
		|	ТоварыВНаличии.МестоХранения КАК МестоХранения,
		|	ТоварыВНаличии.Номенклатура КАК Номенклатура,
		|	ТоварыВНаличии.Характеристика КАК Характеристика,
		|	ТоварыВНаличии.Серия КАК Серия,
		|	ТоварыВНаличии.Партия КАК Партия,
		|	ТоварыВНаличии.ДатаПартии КАК ДатаПартии,
		|	ТоварыВНаличии.Комплект КАК Комплект,
		|	ТоварыВНаличии.Количество КАК Количество,
		|	ТоварыВНаличии.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.ТоварыВНаличии КАК ТоварыВНаличии
		|ГДЕ
		|	ТоварыВНаличии.Регистратор В (&Регистратор)";
		Запрос.УстановитьПараметр("Регистратор", ДокОбъект.ТЧТовары.ВыгрузитьКолонку("ОтгрузкаТовара"));
		ТЗПартии = Запрос.Выполнить().Выгрузить();
	Иначе
		ТЗПартии = ДокОбъект.Движения.ТоварыВНаличии.Выгрузить();
	КонецЕсли;
	Возврат ТЗПартии;
КонецФункции

Функция ПолучитьДополнительныеРасходыПоРеализации(ДокОбъект)
	Если ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.НакладнаяПоОтгрузкамТовара Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеРасходы.Период КАК Период,
		|	ДополнительныеРасходы.Регистратор КАК Регистратор,
		|	ДополнительныеРасходы.НомерСтроки КАК НомерСтроки,
		|	ДополнительныеРасходы.Активность КАК Активность,
		|	ДополнительныеРасходы.ВидДвижения КАК ВидДвижения,
		|	ДополнительныеРасходы.МестоХранения КАК МестоХранения,
		|	ДополнительныеРасходы.Номенклатура КАК Номенклатура,
		|	ДополнительныеРасходы.Характеристика КАК Характеристика,
		|	ДополнительныеРасходы.Серия КАК Серия,
		|	ДополнительныеРасходы.Партия КАК Партия,
		|	ДополнительныеРасходы.СтатьяДДС КАК СтатьяДДС,
		|	ДополнительныеРасходы.Комплект КАК Комплект,
		|	ДополнительныеРасходы.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.ДополнительныеРасходы КАК ДополнительныеРасходы
		|ГДЕ
		|	ДополнительныеРасходы.Регистратор В(&Регистратор)";
		Запрос.УстановитьПараметр("Регистратор", ДокОбъект.ТЧТовары.ВыгрузитьКолонку("ОтгрузкаТовара"));
		ТЗПартии = Запрос.Выполнить().Выгрузить();
	Иначе
		ТЗПартии = ДокОбъект.Движения.ДополнительныеРасходы.Выгрузить();
	КонецЕсли;
	Возврат ТЗПартии;
КонецФункции

#КонецОбласти
